{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Ira",
    "1": "Miedo",
    "2": "Tristeza",
    "3": "Alegr\u00eda",
    "4": "Confianza",
    "5": "Anticipaci\u00f3n",
    "6": "Sorpresa",
    "7": "Neutral"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Alegr\u00eda": 3,
    "Anticipaci\u00f3n": 5,
    "Confianza": 4,
    "Ira": 0,
    "Miedo": 1,
    "Neutral": 7,
    "Sorpresa": 6,
    "Tristeza": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.54.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31002
}
